swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
/***************************************************************************//**
* \file CapSense_1_Centroid_LL.c
* \version 3.0
*
* \brief
*   This file provides the source code for the centroid calculation methods
*   of the Component.
*
* \see CapSense_1 v3.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#include <string.h>
#include "stddef.h"
#include "syslib/cy_syslib.h"
#include "CapSense_1_Centroid_LL.h"
#include "CapSense_1_Configuration.h"
#include "CapSense_1_Structure.h"
#include "CapSense_1_Filter.h"

/*******************************************************************************
* Local definition
*******************************************************************************/
#if CapSense_1_CSX_TOUCHPAD_WIDGET_EN
    #define CapSense_1_CSX_TOUCHPAD_BUFFER_SIZE \
            (((CapSense_1_CSX_MAX_LOCAL_PEAKS + 3u) * sizeof(int8)) +                                 /* fingerPosIndex */      \
            (CapSense_1_CSX_MAX_LOCAL_PEAKS * CapSense_1_CSX_MAX_LOCAL_PEAKS * sizeof(int32)) + /* distanceMap */         \
            (CapSense_1_CSX_MAX_LOCAL_PEAKS * sizeof(int32)) +                                        /* int32 mins       [] */ \
            (CapSense_1_CSX_MAX_LOCAL_PEAKS * sizeof(int8)) +                                         /* int8  links      [] */ \
            (CapSense_1_CSX_MAX_LOCAL_PEAKS * sizeof(int8)) +                                         /* int8  visited    [] */ \
            (CapSense_1_CSX_MAX_LOCAL_PEAKS * sizeof(int8)))                                          /* int8  markIndices[] */

    #define CapSense_1_CSX_TOUCHPAD_FT_ON_FAIL                (0x81u)
    #define CapSense_1_CSX_TOUCHPAD_TOUCH_ABSENT_ID           (0x82u)
    #define CapSense_1_CSX_TOUCHPAD_DEBOUNCE_ENABLE           (0u)
    #define CapSense_1_CSX_TOUCHPAD_TOUCH_MIN_ID              (0u)
    #define CapSense_1_CSX_TOUCHPAD_TOUCH_MAX_ID              (CapSense_1_CSX_MAX_LOCAL_PEAKS - 1u)
    #define CapSense_1_CSX_TOUCHPAD_INT32                     (0x7FFFFFFFu)
    #define CapSense_1_CSX_TOUCHPAD_TOUCH_DOWN                (0x80u)
    #define CapSense_1_CSX_TOUCHPAD_LIFT_OFF                  (0x40u)
    #define CapSense_1_CSX_TOUCHPAD_DEBOUNCE_MASK             (0x3Fu)
    #define CapSense_1_CSX_TOUCHPAD_POSITION_NONE             (0xFFFFu)
    #define CapSense_1_CSX_TOUCHPAD_Z_SHIFT                   (0x04u)
    #define CapSense_1_CSX_TOUCHPAD_PADDING                   (3Lu)
    #define CapSense_1_CSX_TOUCHPAD_CENTROID_LENGTH           (3u)
    #define CapSense_1_CSX_TOUCHPAD_CENTROID_PREVIOUS         (0u)
    #define CapSense_1_CSX_TOUCHPAD_CENTROID_CENTER           (1u)
    #define CapSense_1_CSX_TOUCHPAD_CENTROID_NEXT             (2u)

#endif /* CapSense_1_CSX_TOUCHPAD_WIDGET_EN */

/*******************************************************************************
* Static variables definition
*******************************************************************************/
#if ((CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN) || \
     (CapSense_1_ENABLE  == CapSense_1_SLIDER_WIDGET_EN))
    static uint8 localMax[CapSense_1_NUM_CENTROIDS];
    static CapSense_1_THRESHOLD_TYPE localDiffArray[CapSense_1_NUM_CENTROIDS][3u];
    static uint8 localMaxIndex;
#endif

#if ( 0u !=CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
    static CapSense_1_CSX_TOUCHPAD_DATA_STRUCT newTouches;
    static CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrNewTouches = &newTouches;
    static uint8 newActiveIDs = 0u;
    static uint8 oldActiveIDs = 0u;

    typedef int32 CapSense_1_CSX_TOUCHPAD_DISTANCE_MAP[CapSense_1_CSX_MAX_LOCAL_PEAKS];
#endif /* ( 0u !=CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

/*******************************************************************************
* API Prototypes
*******************************************************************************/
#if (((CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN) || \
      (CapSense_1_ENABLE  == CapSense_1_SLIDER_WIDGET_EN)) && \
      (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN))
static void CapSense_1_SaveLocalMax(CapSense_1_RAM_SNS_STRUCT ptrSns[],
                                                  uint32 snsCount, uint32 fingerThreshold, uint32 snsIndex);
#endif

#if (0u !=CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
    static void CapSense_1_TransferTouch(uint32 newIndex, uint32 oldIndex, CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches);
    static void CapSense_1_NewTouch(uint32 newIndex, uint8 onDebounce, uint16 fingerOnThreshold);
    __STATIC_INLINE uint8 CapSense_1_GetLowestId(uint16 idMask);
    static uint32 CapSense_1_CalcDistance(uint32 newIndex, uint32 oldIndex, CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches);
    static void CapSense_1_Hungarian(uint8 rowCount, uint8 colCount, int8 *fingerPosIndex,
                                           CapSense_1_CSX_TOUCHPAD_DISTANCE_MAP *distanceMap);
    static void CapSense_1_FillDistanceMap(CapSense_1_CSX_TOUCHPAD_DISTANCE_MAP *distanceMap,
                                                 CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches);
    __STATIC_INLINE void CapSense_1_TouchDownDebounce(void);
    __STATIC_INLINE void CapSense_1_SortByAge(void);
    static void CapSense_1_CopyTouchRecord(CapSense_1_CSX_TOUCHPAD_PEAK_STRUCT *destination,
                                                           CapSense_1_CSX_TOUCHPAD_PEAK_STRUCT *source);
    #if (0u != CapSense_1_OFF_DEBOUNCE_EN)
    __STATIC_INLINE void CapSense_1_LiftOffDebounce(uint8 offDebounce,
                                                           CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches);
    #endif /* (0u != CapSense_1_OFF_DEBOUNCE_EN) */
#endif /* (0u !=CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

#if ((CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN) || \
     (CapSense_1_ENABLE  == CapSense_1_SLIDER_WIDGET_EN))
#if (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpFindLocalMaxSd4pts
****************************************************************************//**
*
* \brief
*   Finds the maximum in the widget differences and prepares array with maximum difference
*   and it's neighbour differences in Legacy mode (only one touch can be found).
*   Finds the maxima in the widget differences and prepares arrays with maxima difference
*   and theirs neighbour differences in Multi-Touch mode (maximum three touches can be found).
*   This API is used in conjunction with CapSense_1_DpCalcLinearCentroid or
*   CapSense_1__DpCalcRadialCentroid, because they use shared static data: localMax[],
*   localDiffArray[][3u], localMaxIndex.
*
* \details
*   The localMax[] is used to store the index of the maximum/maxima.
*   The localDiffArray[][] is used to store values of the maximum/maxima and neighbour differences.
*   The localMaxIndex is used to store the number of maxima have been actually found.
*   The used finding method checks for 4 points : current, next, previous and before previous
*   sensor's position. Depends on these points differences it chooses the previous or before
*   previous position. For radial sliders an closed character of a widget is taken into the account.
*
* \param ptrFlashWdgt
*   The pointer to the the widget flash structure.
*
* \param ptrSns
*   The pointer to the the first sensor.
*
* \param snsCount
*   The total sensor number in the widget.
*
* \param fingerThreshold
*   The finger threshold in the widget.
*
* \return Returns the number of maxima found.
*
*******************************************************************************/
uint32 CapSense_1_DpFindLocalMaxSd4pts(CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt,
                                              CapSense_1_RAM_SNS_STRUCT ptrSns[],
                                              uint32 snsCount, uint32 fingerThreshold)
{
    uint32 i;
    CapSense_1_RAM_SNS_STRUCT *localPtrSns = ptrSns;
    localMaxIndex = 0u;
    int32 slope0 = 0;
    int32 slope1 = (int32)localPtrSns[0].diff;
    int32 slope2 = 0;
    int32 slopeLast = -(int32)localPtrSns[snsCount - 1u].diff;

    #if (0u != CapSense_1_TOTAL_RADIAL_SLIDERS)
        if ((CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType == CapSense_1_WD_RADIAL_SLIDER_E)
        {
            slope1 = (int32)localPtrSns[0].diff - (int32)localPtrSns[snsCount - 1u].diff;
            slope2 = (int32)localPtrSns[snsCount - 1u].diff - (int32)localPtrSns[snsCount - 2u].diff;
            slopeLast = slope1;
        }
    #else
        /* Typecast the parameter to avoid a compiler warning */
        (void) ptrFlashWdgt;
    #endif

    /* Search local maxima for sensorId from 0 to snsCount - 1 */
    for (i = 0uL; i < snsCount; i++ )
    {
        /* Check for the last sensor */
        if ((snsCount - 1uL) == i)
        {
            slope0 = slopeLast;
        }
        else
        {
            slope0 = (int32)localPtrSns[i + 1u].diff - (int32)localPtrSns[i].diff;
        }

        if(0 > slope0)
        {
            if(0 < slope1)
            {
                CapSense_1_SaveLocalMax(ptrSns, snsCount, fingerThreshold, i);
            }
            else
            {
                if(0 == slope1)
                {
                    if(0 == slope2)
                    {
                        CapSense_1_SaveLocalMax(ptrSns, snsCount, fingerThreshold, (i - 1uL));
                    }
                    else
                    {
                        if (0 < slope2)
                        {
                            if (slope2 > (-slope0))
                            {
                                CapSense_1_SaveLocalMax(ptrSns, snsCount, fingerThreshold, i);
                            }
                            else
                            {
                                CapSense_1_SaveLocalMax(ptrSns, snsCount, fingerThreshold, (i - 1uL));
                            }
                        }
                    }
                }
            }
            if (localMaxIndex >= CapSense_1_NUM_CENTROIDS)
            {
                break;
            }
        }
        slope2 = slope1;
        slope1 = slope0;
    }

    return (uint32)(localMaxIndex);
}

