swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
/*******************************************************************************
* Function Name: CapSense_1_SaveLocalMax
****************************************************************************//**
*
* \brief
*   Stores a found local maximum in the arrays.
*
* \details
*   Stores a found local maximum in the localMax array if the difference is greater
*   than a finger threshold. Prepares arrays with maximum neighbour differences for
*   position calculations.
*
* \param *ptrSns
*   A pointer to sensor RAM structure of a found local maximum.
*
* \param snsCount
*   The total sensor number in the widget.
*
* \param fingerThreshold
*   A fingerThreshold to compare with a sensor difference.
*
* \param snsIndex
*   An index of a sensor with a found local maximum.
*
*******************************************************************************/
static void CapSense_1_SaveLocalMax(CapSense_1_RAM_SNS_STRUCT ptrSns[],
                                                    uint32 snsCount, uint32 fingerThreshold, uint32 snsIndex)
{
    CapSense_1_THRESHOLD_TYPE currentDiff = ptrSns[snsIndex].diff;

    if (currentDiff > fingerThreshold)
    {
        /* Store found Peak */
        localMax[localMaxIndex] = (uint8)snsIndex;
        localDiffArray[localMaxIndex][CapSense_1_CENTROID_POS] = currentDiff;

        /* Store neighbour differences */
        if (snsIndex == 0u)
        {
            localDiffArray[localMaxIndex][CapSense_1_CENTROID_POS_PREV] = ptrSns[snsCount - 1u].diff;
            localDiffArray[localMaxIndex][CapSense_1_CENTROID_POS_NEXT] = ptrSns[snsIndex + 1u].diff;
        }
        else if (snsIndex == (snsCount - 1u))
        {
            localDiffArray[localMaxIndex][CapSense_1_CENTROID_POS_PREV] = ptrSns[snsIndex - 1u].diff;
            localDiffArray[localMaxIndex][CapSense_1_CENTROID_POS_NEXT] = ptrSns[0u].diff;
        }
        else
        {
            localDiffArray[localMaxIndex][CapSense_1_CENTROID_POS_PREV] = ptrSns[snsIndex - 1u].diff;
            localDiffArray[localMaxIndex][CapSense_1_CENTROID_POS_NEXT] = ptrSns[snsIndex + 1u].diff;
        }

        localMaxIndex++;
    }
}
#else /* (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN) */

/*******************************************************************************
* Function Name: CapSense_1_DpFindLocalMaxSd
****************************************************************************//**
*
* \brief
*   Finds the maximum in the widget differences and prepares array with maximum difference
*   and it's neighbour differences in Legacy mode (only one touch can be found).
*   Finds the maxima in the widget differences and prepares arrays with maxima difference
*   and theirs neighbour differences in Multi-Touch mode (maximum three touches can be found).
*   This API is used in conjunction with CapSense_1_DpCalcLinearCentroid or
*   CapSense_1__DpCalcRadialCentroid, because they use shared static data: localMax[],
*   localDiffArray[][3u], localMaxIndex.
*
* \details
*   The localMax[] is used to store the index of the maximum/maxima.
*   The localDiffArray[][] is used to store values of the maximum/maxima and neighbour differences.
*   The localMaxIndex is used to store the number of maxima have been actually found.
*
* \param ptrSns The pointer to the first sensor.
* \param snsCount The total sensor number in the widget.
* \param fingerThreshold The finger threshold in the widget.
*
* \return Returns the number of maxima found.
*
*******************************************************************************/
uint32 CapSense_1_DpFindLocalMaxSd(CapSense_1_RAM_SNS_STRUCT ptrSns[], uint32 snsCount,
                                                                                   uint32 fingerThreshold)
{
    uint32 i;
    uint32 sensorId;

    #if (CapSense_1_NUM_CENTROIDS == 0x01u)
        CapSense_1_RAM_SNS_STRUCT *localPtrSns = ptrSns;
        CapSense_1_THRESHOLD_TYPE temp = 0u;
    #endif

    localMaxIndex = 0u;

    #if (CapSense_1_NUM_CENTROIDS == 0x01u)
        for (sensorId = 0u; sensorId < snsCount; sensorId++)
        {
            if ((localPtrSns->diff > fingerThreshold) && (localPtrSns->diff > temp))
            {
                localMax[0u] = CY_LO8(sensorId);
                temp = localPtrSns->diff;
                localMaxIndex = 1u;
            }
            localPtrSns++;
        }
    #else /* (CapSense_1_NUM_CENTROIDS == 0x01u) */

        if ((ptrSns[0u].diff > fingerThreshold) && (ptrSns[0u].diff >= ptrSns[1u].diff))
        {
            localMax[localMaxIndex] = 0u;
            localMaxIndex = 1u;
        }

        if ((ptrSns[snsCount - 1u].diff > fingerThreshold) && (ptrSns[snsCount - 1u].diff > ptrSns[snsCount - 2u].diff))
        {
            localMax[localMaxIndex] = (uint8)(snsCount - 1u);
            localMaxIndex++;
        }

        #if (CapSense_1_NUM_CENTROIDS == 0x02u)
            if (localMaxIndex < CapSense_1_NUM_CENTROIDS)
            {
        #endif /* (CapSense_1_NUM_CENTROIDS == 0x02u) */
                for (sensorId = 1u; sensorId < (snsCount - 1u); sensorId++)
                {
                    if ((ptrSns[sensorId].diff > fingerThreshold) && (ptrSns[sensorId].diff >= ptrSns[sensorId + 1u].diff))
                    {
                        if (ptrSns[sensorId].diff > ptrSns[sensorId - 1u].diff)
                        {
                            localMax[localMaxIndex] = (uint8)sensorId;
                            localMaxIndex++;

                            if (localMaxIndex >= CapSense_1_NUM_CENTROIDS)
                            {
                                break;
                            }
                        }
                    }
                }
        #if (CapSense_1_NUM_CENTROIDS == 0x02u)
            }
        #endif /* (CapSense_1_NUM_CENTROIDS == 0x02u) */
    #endif /* #if (CapSense_1_NUM_CENTROIDS == 0x01u) */

    if (localMaxIndex != 0u)
    {
        /* Prepare single-dimension centroid calculation array */
        for (i = 0u; i < localMaxIndex; i++)
        {
             localDiffArray[i][CapSense_1_CENTROID_POS] = ptrSns[localMax[i]].diff;

