swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
            if (localMax[i] == 0u)
            {
                localDiffArray[i][CapSense_1_CENTROID_POS_PREV] = ptrSns[snsCount - 1u].diff;
                localDiffArray[i][CapSense_1_CENTROID_POS_NEXT] = ptrSns[localMax[i] + 1u].diff;
            }
            else if (localMax[i] == ((uint8)(snsCount - 1u)))
            {
                localDiffArray[i][CapSense_1_CENTROID_POS_PREV] = ptrSns[localMax[i] - 1u].diff;
                localDiffArray[i][CapSense_1_CENTROID_POS_NEXT] = ptrSns[0u].diff;
            }
            else
            {
                localDiffArray[i][CapSense_1_CENTROID_POS_PREV] = ptrSns[localMax[i] - 1u].diff;
                localDiffArray[i][CapSense_1_CENTROID_POS_NEXT] = ptrSns[localMax[i] + 1u].diff;
            }
        }
    }
    /* Return status to check if at least one maximum has been found */
    return (uint32)(localMaxIndex);
}
#endif /* (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN) */
#endif /* ((CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN) || \
          (CapSense_1_ENABLE  == CapSense_1_SLIDER_WIDGET_EN)) */

#if CapSense_1_TOTAL_DIPLEXED_SLIDERS
/*******************************************************************************
* Function Name: CapSense_1_DpFindLocalMaxDiplex
****************************************************************************//**
*
* \brief
*   Finds the maximum in the widget differences. Used only for diplexed linear slider.
*
* \details
*   The localMax[] is used to store the index of the maximum/maxima.
*   The localDiffArray[][] is used to store values of the maximum/maxima and neighbour differences.
*   The localMaxIndex is used to store the number of maxima have been actually found.
*
* \param ptrSns The pointer to the first sensor.
* \param snsCount The total sensor number in the widget.
* \param diplexTable The pointer to the diplex table.
* \param fingerThreshold The finger threshold in the widget.
*
* \return Returns the number of maxima found.
*
*******************************************************************************/
uint32 CapSense_1_DpFindLocalMaxDiplex(
                        CapSense_1_RAM_SNS_STRUCT ptrSns[],
                        uint32 snsCount,
                        uint8 const diplexTable[],
                        uint32 fingerThreshold)
{
    uint32 sensorId;
    uint32 diplexSensorId;

    uint32 biggestStartPos = 0u;
    uint32 biggestSize = 0u;
    uint32 curStartPos = 0u;
    uint32 curSize = 0u;
    CapSense_1_THRESHOLD_TYPE temp = 0u;

    localMaxIndex = 0u;

    for (sensorId = 0u; sensorId < (snsCount << 1u); sensorId++)
    {
        diplexSensorId = diplexTable[sensorId];

        if (ptrSns[diplexSensorId].diff > fingerThreshold)
        {
            if (0u == curSize)
            {
                curStartPos = sensorId;
            }

            curSize++;
        }
        else
        {
            if (curSize > biggestSize)
            {
                biggestSize = curSize;
                biggestStartPos = curStartPos;
            }
            curSize = 0u;
        }
    }

    if (curSize > biggestSize)
    {
        biggestSize = curSize;
        biggestStartPos = curStartPos;
    }

    if (biggestSize >= CapSense_1_CENTROID_DIPLEX_SECTION_LENGTH)
    {
        for (sensorId = biggestStartPos; sensorId < (biggestStartPos + biggestSize); sensorId++)
        {
            diplexSensorId = diplexTable[sensorId];

            if (ptrSns[diplexSensorId].diff > temp)
            {
                localMax[0u] = CY_LO8(sensorId);
                temp = ptrSns[diplexSensorId].diff;
                localMaxIndex = 1u;
            }
        }

        /* Prepare single-dimension centroid calculation array */
        if (localMax[0u] == 0u)
        {
            localDiffArray[0u][CapSense_1_CENTROID_POS_PREV] = 0u;
            localDiffArray[0u][CapSense_1_CENTROID_POS] = ptrSns[localMax[0u]].diff;
            localDiffArray[0u][CapSense_1_CENTROID_POS_NEXT] = ptrSns[localMax[0u] + 1u].diff;

        }
        else if (localMax[0u] == ((snsCount << 1u) - 1u))
        {
            diplexSensorId = diplexTable[localMax[0u] - 1u];
            localDiffArray[0u][CapSense_1_CENTROID_POS_PREV] = ptrSns[diplexSensorId].diff;
            diplexSensorId = diplexTable[localMax[0u]];
            localDiffArray[0u][CapSense_1_CENTROID_POS] = ptrSns[diplexSensorId].diff;
            localDiffArray[0u][CapSense_1_CENTROID_POS_NEXT] = 0u;
        }
        else
        {
            diplexSensorId = diplexTable[localMax[0u] - 1u];
            localDiffArray[0u][CapSense_1_CENTROID_POS_PREV] = ptrSns[diplexSensorId].diff;
            diplexSensorId = diplexTable[localMax[0u]];
            localDiffArray[0u][CapSense_1_CENTROID_POS] = ptrSns[diplexSensorId].diff;
            diplexSensorId = diplexTable[localMax[0u] + 1u];
            localDiffArray[0u][CapSense_1_CENTROID_POS_NEXT] = ptrSns[diplexSensorId].diff;
        }
    }

    return (uint32)(localMaxIndex);
}
#endif /* #if CapSense_1_TOTAL_DIPLEXED_SLIDERS */


#if ((0u != CapSense_1_TOTAL_LINEAR_SLIDERS) || \
     (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN))
/*******************************************************************************
* Function Name: CapSense_1_DpCalcLinearCentroid
****************************************************************************//**
*
* \brief
*   Calculates the position of the linear slider.
*
* \details
*   The localMax[] is used to store the index of the maximum/maxima.
*   The localDiffArray[][] is used to store values of the maximum/maxima and neighbour differences.
*   The localMaxIndex is used to store the number of maxima have been actually found.
*
* \param position
*  The pointer to the position array for temporary position storage.
*
* \param multiplier
*  The multiplier used for position calculation. Contains the widget resolution and total sensor
*  information. It is generated by customizer.
*
* \param snsCount
*  The number of sensors in the linear slider. The doubled snsCount has to be passed
*  if this API is called for diplexed slider.
*
* \param offset
*  The additional position offset as half of the multiplier.
*
* \return Returns the number of positions calculated.
*
*******************************************************************************/
uint32 CapSense_1_DpCalcLinearCentroid(uint16 position[], uint32 multiplier, uint32 snsCount, uint32 offset)
{
    int32 numerator;
    int32 denominator;
    uint32 i;

    for (i = 0u; i < localMaxIndex; i++)
    {
        /*
         * The CapSense_1_DpFindLocalMaxSd API prepares the unified localDiffArray[][] for linear and radial sliders.
         *  Therefore, the difference of the first and the last elements of linear slider are cleared.
         */

