swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
        if (localMax[i] == 0u)
        {
            localDiffArray[i][CapSense_1_CENTROID_POS_PREV] = 0u;
        }
        else
        {
            if (localMax[i] == (snsCount - 1u))
            {
                localDiffArray[i][CapSense_1_CENTROID_POS_NEXT] = 0u;
            }
        }

        /* Si+1 - Si-1 */
        numerator = (int32) localDiffArray[i][CapSense_1_CENTROID_POS_NEXT] -
                    (int32) localDiffArray[i][CapSense_1_CENTROID_POS_PREV];

        /* Si+1 + Si + Si-1 */
        denominator = (int32) localDiffArray[i][CapSense_1_CENTROID_POS_PREV] +
                      (int32) localDiffArray[i][CapSense_1_CENTROID_POS] +
                      (int32) localDiffArray[i][CapSense_1_CENTROID_POS_NEXT];

        denominator = ((numerator * (int32)multiplier) / denominator) +
                      (((int32)localMax[i] * (int32)multiplier) + (int32)offset);

        /* Round result and shift 8 bits left */
        position[i] = CY_LO16(((uint32)denominator + CapSense_1_CENTROID_ROUND_VALUE) >> 8u);
    }
    return (uint32)(localMaxIndex);
}
#endif /* ((0u != CapSense_1_TOTAL_LINEAR_SLIDERS) || \
          (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)) */


#if CapSense_1_TOTAL_RADIAL_SLIDERS
/*******************************************************************************
* Function Name: CapSense_1_DpCalcRadialCentroid
****************************************************************************//**
*
* \brief
*   Calculates the position of the radial slider.
*
* \details
*   The localMax[] is used to store the index of the maximum/maxima.
*   The localDiffArray[][] is used to store values of the maximum/maxima and neighbour differences.
*   The localMaxIndex is used to store the number of maxima have been actually found.
*
* \param *position The pointer to the position array for temporary storage.
* \param multiplier The multiplier used for position calculation.
*                       Contains the widget resolution and total sensor information. It is generated by customizer.
* \param snsCount The total sensor number in the widget.
*
* \return Returns the number of positions calculated.
*
*******************************************************************************/
uint32 CapSense_1_DpCalcRadialCentroid(uint16 position[], uint32 multiplier, uint32 snsCount)
{
    int32 numerator;
    int32 denominator;
    uint32 i;

    for (i = 0u; i < localMaxIndex; i++)
    {
        /* Si+1 - Si-1 */
        numerator = (int32) localDiffArray[i][CapSense_1_CENTROID_POS_NEXT] -
                    (int32) localDiffArray[i][CapSense_1_CENTROID_POS_PREV];

        /* Si+1 + Si + Si-1 */
        denominator = (int32) localDiffArray[i][CapSense_1_CENTROID_POS_PREV] +
                      (int32) localDiffArray[i][CapSense_1_CENTROID_POS] +
                      (int32) localDiffArray[i][CapSense_1_CENTROID_POS_NEXT];

        denominator = ((numerator * (int32)multiplier) / denominator) +
                       ((int32)localMax[i] * (int32)multiplier);

        if (denominator < 0)
        {
            denominator += ((int32)snsCount * (int32)multiplier);
        }

        /* Round result and shift 8 bits left */
        position[i] = CY_LO16(((uint32)denominator + CapSense_1_CENTROID_ROUND_VALUE) >> 8u);
    }
    return (uint32)(localMaxIndex);
}
#endif /* #if CapSense_1_TOTAL_RADIAL_SLIDERS */


#if ( 0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpFindLocalMaxDd
****************************************************************************//**
*
* \brief
*   Finds up to 5 local maxima in the CSX TouchPad difference data.
*
* \details
*  The column and row number of each maximum and total number of found maxima
*  are stored in the structure pointed by ptr2CsxTouchpad in
*  the Flash Widget Structure.
*
* \param ptrFlashWdgt The pointer to the Flash Widget Structure.
*
*******************************************************************************/
void CapSense_1_DpFindLocalMaxDd(
                        CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    CapSense_1_RAM_WD_CSX_TOUCHPAD_STRUCT *ptrWidgetRam = ptrFlashWdgt->ptr2WdgtRam;
    CapSense_1_RAM_SNS_STRUCT *ptrSensor =  ptrFlashWdgt->ptr2SnsRam;
    uint16 signalThreshold = (uint16)ptrWidgetRam->fingerTh - ptrWidgetRam->hysteresis;
    uint16 currDiff;
    uint8 rx;
    uint8 tx;
    uint8 snsShift;
    uint8 lastRx = ptrFlashWdgt->numCols - 1u;
    uint8 lastTx = ptrFlashWdgt->numRows - 1u;
    uint32 proceed = 0u;

    /* Initialize new touches structure */
    ptrNewTouches->touchNum = 0u;

    /* Go through all Rx electrodes */
    for (rx = 0u; rx <= lastRx; rx++)
    {
        /* Go through all Tx and RX(changed above) electrodes intersections and check if local maximum reqirement is met */
        for (tx = 0u; tx <= lastTx; tx++)
        {
            proceed = 0u;

            currDiff = ptrSensor->diff;

            if (currDiff < signalThreshold)
            {
                proceed = 1u;
            }

            /* Check local maximum requirement: Comparing raw count of a local maximum candidate with
             * raw counts of sensors from the previous row */
            if ((0u == proceed) && (rx > 0u))
            {
                /* Sensor(i-1, j+1) */
                snsShift = lastTx;

                if ((tx < lastTx) && (currDiff <= (ptrSensor - snsShift)->diff))
                {
                    proceed = 1u;
                }

                if (0u == proceed)
                {
                    /* Sensor(i-1, j) */
                    snsShift++;

                    if (currDiff <= (ptrSensor - snsShift)->diff)
                    {
                        proceed = 1u;
                    }
                }

                if (0u == proceed)
                {
                    /* Sensor(i-1, j-1) */
                    snsShift++;

                    if ((tx > 0u) && (currDiff <= (ptrSensor - snsShift)->diff))
                    {
                        proceed = 1u;
                    }
                }
            }

            /* Check local maximum requirement: Comparing raw count of a local maximum candidate with
             * raw counts of sensors from the next row */
            if ((0u == proceed) && (rx < lastRx))
            {
                /* Sensor(i+1, j+1) */
                snsShift = lastTx + 2u;

                if ((tx < lastTx) && (currDiff < (ptrSensor + snsShift)->diff))
                {
                    proceed = 1u;
                }

