swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
                if (0u == proceed)
                {
                    /* Sensor(i+1, j) */
                    snsShift--;

                    if (currDiff < (ptrSensor + snsShift)->diff)
                    {
                        proceed = 1u;
                    }
                }

                if (0u == proceed)
                {
                    /* Sensor(i+1, j-1) */
                    snsShift--;

                    if ((tx > 0u) && (currDiff < (ptrSensor + snsShift)->diff))
                    {
                        proceed = 1u;
                    }
                }
            }

            /* Check local maximum requirement: Comparing raw count of a local maximum candidate with
             * raw counts of sensors from the same row
             * Sensor(i, j+1) */
            if ((0u == proceed) && (tx < lastTx))
            {
                if (currDiff < (ptrSensor + 1u)->diff)
                {
                    proceed = 1u;
                }
            }

            /* Sensor(i, j-1) */
            if ((0u == proceed) && (tx > 0u))
            {
                if (currDiff <= (ptrSensor - 1u)->diff)
                {
                    proceed = 1u;
                }
            }

            /* Add local maximum to the touch structure if there is a room */
            if ((0u == proceed) && (ptrNewTouches->touchNum < CapSense_1_CSX_MAX_LOCAL_PEAKS))
            {
                ptrNewTouches->touch[ptrNewTouches->touchNum].x = rx;
                ptrNewTouches->touch[ptrNewTouches->touchNum].y = tx;

                ptrNewTouches->touch[ptrNewTouches->touchNum].rawCount = currDiff;
                ptrNewTouches->touchNum++;
            }

            ptrSensor++;
        }
    }
}


/*******************************************************************************
* Function Name: CapSense_1_DpCalcTouchPadCentroid
****************************************************************************//**
*
* \brief
*   Calculates the position for each local maximum using the 3x3 algorithm.
*
* \details
*  Stores a result in the structure pointed by ptr2CsxTouchpad at the same
*  fields as the column/row number.
*
* \param ptrFlashWdgt The pointer to the Flash Widget Structure.
*
*******************************************************************************/
void CapSense_1_DpCalcTouchPadCentroid(
                        CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    CapSense_1_RAM_SNS_STRUCT *ptrSensor =  ptrFlashWdgt->ptr2SnsRam;
    uint8 number;
    uint8 i;
    uint8 j;
    uint8 lastRx = ptrFlashWdgt->numCols - 1u;
    uint8 lastTx = ptrFlashWdgt->numRows - 1u;
    uint16 centroid[3u][3u];
    int32 weightedSumX;
    int32 weightedSumY;
    uint32 totalSum;

    for(number = 0u; number < ptrNewTouches->touchNum; number++)
    {
        /* Set the sensor pointer to the local maximum sensor */
        ptrSensor =  ptrFlashWdgt->ptr2SnsRam;
        ptrSensor += (ptrNewTouches->touch[number].y + (ptrNewTouches->touch[number].x * ptrFlashWdgt->numRows));

        /* Prepare 3x3 centroid two dimensional array */
        /* Fill each row */
        for (i = 0u; i < CapSense_1_CSX_TOUCHPAD_CENTROID_LENGTH; i++)
        {
            /* The first  condition could be valid only when local max on the first row (0 row) of Touchpad
             * The second condition could be valid only when local max on the last row of Touchpad
             * Then corresponding row (zero or the last) of 3x3 array is initialized to 0u */
            if (((((int32)ptrNewTouches->touch[number].x - 1) + (int32)i) < 0) ||
                ((((int32)ptrNewTouches->touch[number].x - 1) + (int32)i) > (int32)lastRx))
            {
                centroid[CapSense_1_CSX_TOUCHPAD_CENTROID_PREVIOUS][i] = 0u;
                centroid[CapSense_1_CSX_TOUCHPAD_CENTROID_CENTER][i] = 0u;
                centroid[CapSense_1_CSX_TOUCHPAD_CENTROID_NEXT][i] = 0u;
            }
            else
            {
                /* Fill each column */
                for (j = 0u; j < CapSense_1_CSX_TOUCHPAD_CENTROID_LENGTH; j++)
                {
                    /* The first  condition could be valid only when local max on the first column (0 row) of Touchpad
                     * The second condition could be valid only when local max on the last column of Touchpad
                     * Then corresponding column (zero or the last) of 3x3 array is initialized to 0u */
                    if (((((int32)ptrNewTouches->touch[number].y - 1) + (int32)j) < 0) ||
                        ((((int32)ptrNewTouches->touch[number].y - 1) + (int32)j) > (int32)lastTx))
                    {
                        centroid[j][i] = 0u;
                    }
                    else
                    {
                        centroid[j][i] = (uint16)(ptrSensor + (((i - 1u) * ptrFlashWdgt->numRows) + (j - 1u)))->diff;
                    }
                }
            }
        }

        weightedSumX = 0;
        weightedSumY = 0;
        totalSum = 0u;

        /* Calculate centroid */
        for (i = 0u; i < CapSense_1_CSX_TOUCHPAD_CENTROID_LENGTH; i++)
        {
            for (j = 0u; j < CapSense_1_CSX_TOUCHPAD_CENTROID_LENGTH; j++)
            {
                totalSum += centroid[i][j];
                weightedSumX += (int32)centroid[i][j] * ((int32)j - 1);
                weightedSumY += (int32)centroid[i][j] * ((int32)i - 1);
            }
        }

        /* The X position is calculated.
        * The weightedSumX value depends on a finger position shifted regarding the X electrode (ptrNewTouches->touch[number].x)
        * The multiplier ptrFlashWdgt->xCentroidMultiplier is a short from:
        * CapSense_1_TOUCHPAD0_X_RESOLUTION * 256u) / (CapSense_1_TOUCHPAD0_NUM_RX - CONFIG))
        * where CONFIG = 0 or 1 depends on TouchpadMultiplerMethod parameter
        */
        weightedSumX = ((weightedSumX * (int32)ptrFlashWdgt->xCentroidMultiplier) / (int32)totalSum) +
                        ((int32)ptrNewTouches->touch[number].x * (int32)ptrFlashWdgt->xCentroidMultiplier);
        /* Position correction for half of a sensor */
        #if (CapSense_1_ENABLE == CapSense_1_TOUCHPAD_MULT_METHOD)
            weightedSumX += (((int32)ptrFlashWdgt->xCentroidMultiplier) / 2);
        #endif

