swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
        /* The X position is rounded to the nearest integer value and normalized to the resolution range */
        ptrNewTouches->touch[number].x = CY_LO16(((uint32)weightedSumX + CapSense_1_CENTROID_ROUND_VALUE) >> 8u);

        /* The Y position is calculated.
        * The weightedSumY value depends on a finger position shifted regarding the Y electrode (ptrNewTouches->touch[number].y)
        * The multiplier ptrFlashWdgt->yCentroidMultiplier is a short from:
        * CapSense_1_TOUCHPAD0_Y_RESOLUTION * 256u) / (CapSense_1_TOUCHPAD0_NUM_TX - CONFIG))
        * where CONFIG = 0 or 1 depends on TouchpadMultiplerMethod parameter
        */
        weightedSumY = ((weightedSumY * (int32)ptrFlashWdgt->yCentroidMultiplier) / (int32)totalSum) +
                        ((int32)ptrNewTouches->touch[number].y * (int32)ptrFlashWdgt->yCentroidMultiplier);
        /* Position correction for half of a sensor */
        #if (CapSense_1_ENABLE == CapSense_1_TOUCHPAD_MULT_METHOD)
            weightedSumY += (((int32)ptrFlashWdgt->yCentroidMultiplier) / 2);
        #endif

        /* The Y position is rounded to the nearest integer value and normalized to the resolution range */
        ptrNewTouches->touch[number].y = CY_LO16(((uint32)weightedSumY + CapSense_1_CENTROID_ROUND_VALUE) >> 8u);

        /* The z value is a sum of raw counts of sensors that form 3x3 matrix with a local maximum in the center */
        ptrNewTouches->touch[number].z = CY_LO8(totalSum >> CapSense_1_CSX_TOUCHPAD_Z_SHIFT);
    }
}


/*******************************************************************************
* Function Name: CapSense_1_DpTouchTracking
****************************************************************************//**
*
* \brief
*   Tracks the found touches:
*    - associates them with previous touches (DistanceMap, Hungarian)
*    - applies the position filters
*    - suppresses excessive touches
*
* \details
*  The final touch data is placed into a structure pointed by the ptr2CsxTouchpad
*  member of the Flash Widget Structure.
*
* \param ptrFlashWdgt The pointer to the Flash Widget Structure.
*
*******************************************************************************/
void CapSense_1_DpTouchTracking(
                        CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    CapSense_1_RAM_WD_CSX_TOUCHPAD_STRUCT *ptrWidgetRam = ptrFlashWdgt->ptr2WdgtRam;
    CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches = ptrFlashWdgt->ptr2CsxTouchpad;
    CapSense_1_CSX_TOUCHPAD_DISTANCE_MAP *distanceMap;
    int8 *fingerPosIndex;
    static int8 touchPadBuffer[CapSense_1_CSX_TOUCHPAD_BUFFER_SIZE];
    uint32 i;
    uint8 newTouchNum = ptrNewTouches->touchNum;
    uint16 fingerOnThreshold = (uint16)ptrWidgetRam->fingerTh + ptrWidgetRam->hysteresis;

    if ((0u != newTouchNum) || (0u != ptrOldTouches->touchNum))
    {
        /* Initialize variables */
        newActiveIDs = 0u;
        /* Getting active touch IDs from previous scan */
        oldActiveIDs = 0u;
        for (i = 0u; i < ptrOldTouches->touchNum; i++)
        {
            oldActiveIDs |= (uint8)(1u << ptrOldTouches->touch[i].id);
        }

        /* Set up the fingerPosIndex to the head of scratch buffer. It will be used to hold association between previous and current fingers */
        fingerPosIndex = touchPadBuffer;

        /* This is a int32 matrix sized MAX_LOCAL_PEAKS x MAX_LOCAL_PEAKS. Make sure its start address is divisible by 4 */
        distanceMap = (CapSense_1_CSX_TOUCHPAD_DISTANCE_MAP *)
                      (((uint32)touchPadBuffer + (CapSense_1_CSX_MAX_LOCAL_PEAKS + CapSense_1_CSX_TOUCHPAD_PADDING)) &
                        (uint32)~CapSense_1_CSX_TOUCHPAD_PADDING);

        if (0u < newTouchNum)
        {
            for (i = CapSense_1_CSX_MAX_LOCAL_PEAKS; i-- > 0u;)
            {
                /* Set all new touches structure array members as not assigned */
                ptrNewTouches->touch[i].id = CapSense_1_CSX_TOUCHPAD_UNDEFINED;
            }

            if (0u == ptrOldTouches->touchNum)
            {
                /* If the previous touch tracking had not any touches. */
                for (i = 0u; i < newTouchNum; i++)
                {
                    /* Initializes a new touch, set ID to next value and Age to 0. */
                    CapSense_1_NewTouch(i, ptrWidgetRam->onDebounce, fingerOnThreshold);
                }
            }
            else
            {
                /* General case */
                if (newTouchNum >= ptrOldTouches->touchNum)
                {
                    if ((1u == newTouchNum) && (1u == ptrOldTouches->touchNum))
                    {
                        /* Don't call Hungarian for 1 current and 1 previous touch. */
                        fingerPosIndex[0u] = 0;
                    }
                    else
                    {
                        /* Calculating and filling Distance Map array. */
                        CapSense_1_FillDistanceMap(distanceMap, ptrOldTouches);

                        /* Call Hungarian method procedure. */
                        CapSense_1_Hungarian(newTouchNum, ptrOldTouches->touchNum, fingerPosIndex, distanceMap);
                    }

                    for (i = 0u; i < ptrOldTouches->touchNum; i++)
                    {
                        if (ptrWidgetRam->velocity <
                            CapSense_1_CalcDistance((uint32)fingerPosIndex[i], i, ptrOldTouches))
                        {
                            /* Set new ID and reset Age. */
                            CapSense_1_NewTouch((uint32)fingerPosIndex[i], ptrWidgetRam->onDebounce, fingerOnThreshold);
                        }
                        else
                        {
                            /* Set ID to previous value and increase Age. */
                            newActiveIDs |= (uint8)(1u << (ptrOldTouches->touch[i].id));
                            CapSense_1_TransferTouch((uint32)fingerPosIndex[i], i, ptrOldTouches);
                        }
                    }

