swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
                    /* Added new fingers, they need to assign ID. */
                    if (newTouchNum > ptrOldTouches->touchNum)
                    {
                        /* Search new fingers. */
                        for (i = 0u; i < newTouchNum; i++)
                        {
                            /* New finger found. */
                            if (ptrNewTouches->touch[i].id == CapSense_1_CSX_TOUCHPAD_UNDEFINED)
                            {
                                CapSense_1_NewTouch(i, ptrWidgetRam->onDebounce, fingerOnThreshold);
                            }
                        }
                    }
                }
                else
                {
                    /* newTouchNum is less than ptrOldTouches->touchNum */

                    /* Calculating and filling Distance Map array. */
                    CapSense_1_FillDistanceMap(distanceMap, ptrOldTouches);

                    /* Call Hungarian method procedure. */
                    CapSense_1_Hungarian(ptrOldTouches->touchNum, newTouchNum, fingerPosIndex, distanceMap);

                    for (i = 0u; i < newTouchNum; i++)
                    {
                        if (ptrWidgetRam->velocity <
                            CapSense_1_CalcDistance(i, (uint32)fingerPosIndex[i], ptrOldTouches))
                        {
                            /* Set new ID and reset Age. */
                            CapSense_1_NewTouch(i, ptrWidgetRam->onDebounce, fingerOnThreshold);
                        }
                        else
                        {
                            /* Set ID to previous value and increase Age. */
                            newActiveIDs |= (uint8)(1u << (ptrOldTouches->touch[i].id));
                            CapSense_1_TransferTouch(i, (uint32)fingerPosIndex[i], ptrOldTouches);
                        }
                    }
                }
            }

            CapSense_1_TouchDownDebounce();
        }

        #if CapSense_1_OFF_DEBOUNCE_EN
            CapSense_1_LiftOffDebounce(ptrWidgetRam->offDebounce, ptrOldTouches);
        #endif

        if ((ptrNewTouches->touchNum >= 1u) || (ptrOldTouches->touchNum != 0u))
        {
            CapSense_1_SortByAge();
        }

        /* Store new touches as old touches */
        for (i = ptrNewTouches->touchNum; i-- > 0u;)
        {
            CapSense_1_CopyTouchRecord(&ptrOldTouches->touch[i], &ptrNewTouches->touch[i]);
        }

        ptrOldTouches->touchNum = ptrNewTouches->touchNum;

        /* Save ID allocation masks for usage in the next iteration. */
        oldActiveIDs = newActiveIDs;
    }
 }


/*******************************************************************************
* Function Name: CapSense_1_TransferTouch
****************************************************************************//**
*
* \brief
*   Copies ID, increments age and decrements debounce(if debounce > 0) parameters
*   for the new touch that has been detected also in the old touches.
*
* \details
*   Copies ID, increments age and decrements debounce(if debounce > 0) parameters
*   for the new touch that has been detected also in the old touches.
*
* \param newIndex The touch index of touch array in the new touches structure.
* \param oldIndex The touch index of touch array in the old touches structure.
* \param ptrOldTouches The pointer to the old touches structure.
*
*******************************************************************************/
static void CapSense_1_TransferTouch(
                            uint32 newIndex, uint32 oldIndex, CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches)
{
    ptrNewTouches->touch[newIndex].id = ptrOldTouches->touch[oldIndex].id;

    ptrNewTouches->touch[newIndex].age = ptrOldTouches->touch[oldIndex].age + 1u;

    /* Decrement debounce counter if the touch in touch down ot lift off stage (debounce counter > 0) */
    if (0u != (ptrOldTouches->touch[oldIndex].debounce & CapSense_1_CSX_TOUCHPAD_DEBOUNCE_MASK))
    {
        ptrNewTouches->touch[newIndex].debounce = ptrOldTouches->touch[oldIndex].debounce - 1u;
    }
    else
    {
        ptrNewTouches->touch[newIndex].debounce = ptrOldTouches->touch[oldIndex].debounce;
    }
}


/*******************************************************************************
* Function Name: CapSense_1_NewTouch
****************************************************************************//**
*
* \brief
*   Set ID, age and on debounce parameters for a new touch.
*
* \details
*   Raw count of a local maximum has to be higher than fingerOnThreshold threshold
*   so the new touch is accepted. If raw count is lower than the fingerOnThreshold
*   than corresponding touch is marked with CapSense_1_CSX_TOUCHPAD_FT_ON_FAIL
*   ID and will be deleted from new touches structure in CapSense_1_SortByAge()
*   (new touches structure is reorganized in this case).
*
* \param newIndex The touch index of touch array in the new touches structure.
* \param onDebounce Counter value for touch down procedure.
* \param fingerOnThreshold The finger ON threshold (finger threshold + hysteresis)
*
*******************************************************************************/
static void CapSense_1_NewTouch(uint32 newIndex, uint8 onDebounce, uint16 fingerOnThreshold)
{
    uint32 idx;

    /* Touch is not accepted */
    if (ptrNewTouches->touch[newIndex].rawCount < fingerOnThreshold)
    {
        ptrNewTouches->touch[newIndex].id = CapSense_1_CSX_TOUCHPAD_FT_ON_FAIL;
    }
    else
    {
        /* Create a bit map of ID's currently used and previously used and search for the new lowest ID */
        idx = CapSense_1_GetLowestId(((uint16)oldActiveIDs | (uint16)newActiveIDs));

        /* Indicate that ID is now taken */
        newActiveIDs |= (uint8)(1u << idx);

        /* Set the ID */
        ptrNewTouches->touch[newIndex].id = CY_LO8(idx);

        /* Set the age */
        ptrNewTouches->touch[newIndex].age = 1u;

        /* New Finger goes through touchdown debounce procedure if required */
        ptrNewTouches->touch[newIndex].debounce = onDebounce | CapSense_1_CSX_TOUCHPAD_TOUCH_DOWN;
    }
}


