swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
/*******************************************************************************
* Function Name: CapSense_1_GetLowestId
****************************************************************************//**
*
* \brief
*   Returns the lowest available touch ID.
*
* \details
*   Returns the lowest available touch ID.
*
* \param idMask The mask of IDs used in new and old touches.
*
* \return   Returns the lowest available touch ID. If no ID was available,
*           CapSense_1_CSX_TOUCHPAD_TOUCH_ABSENT_ID is returned.
*
*******************************************************************************/
__STATIC_INLINE uint8 CapSense_1_GetLowestId(uint16 idMask)
{
    uint32 idx;
    uint32 touchId = CapSense_1_CSX_TOUCHPAD_TOUCH_ABSENT_ID;

    /* Search for the lowest available ID. */
    idMask >>= CapSense_1_CSX_TOUCHPAD_TOUCH_MIN_ID;

    for (idx = CapSense_1_CSX_TOUCHPAD_TOUCH_MIN_ID; idx <= CapSense_1_CSX_TOUCHPAD_TOUCH_MAX_ID; idx++)
    {
        /* Determine if the new ID is available. */
        if (0u == (idMask & 1u))
        {
            touchId = idx;
            break;
        }

        idMask >>= 1u;
    }

    /* Return an indicator of failure. */
    return (uint8)(touchId);
}


/*******************************************************************************
* Function Name: CapSense_1_TouchDownDebounce
****************************************************************************//**
*
* \brief
*   Handles touch down de-bouncing.
*
* \details
*   Even if a new touch is detected it is not considered as active until
*   on debounce counter has not reached zero. If on debounce counter has reached zero
*   the touch down mask is cleared. Otherwise the age of the new finger is cleared
*   (it is considered as not active)
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_TouchDownDebounce(void)
{
    uint32 i;

    for (i = 0u; i < ptrNewTouches->touchNum; i++)
    {
        /* If it is a touchdown debouncing finger its age is set to zero */
        if (0u != (ptrNewTouches->touch[i].debounce & CapSense_1_CSX_TOUCHPAD_TOUCH_DOWN))
        {
            if ((ptrNewTouches->touch[i].debounce & CapSense_1_CSX_TOUCHPAD_DEBOUNCE_MASK) <= 1u)
            {
                /* If debounce counter reached zero than touch down stage
                 * is finished and corresponding mask is cleared
                 */
                ptrNewTouches->touch[i].debounce &=
                    (uint8)~(CapSense_1_CSX_TOUCHPAD_TOUCH_DOWN | CapSense_1_CSX_TOUCHPAD_DEBOUNCE_MASK);
            }
            else
            {
                /* Set the age to zero - finger is not active */
                ptrNewTouches->touch[i].age = 0u;
            }
        }
    }
}


#if (0u != CapSense_1_OFF_DEBOUNCE_EN)
/*******************************************************************************
* Function Name: CapSense_1_LiftOffDebounce
****************************************************************************//**
*
* \brief
*   Handles lift off de-bouncing.
*
* \details
*   Even if a touch is not present in new touches, but present in old
*   touches this means it is lift off event. This touch is considered as active and
*   is added to new touches structure until the offDebounce counter reaches zero.
*   The offDebounce counter is set when lift off event is detected and is decremented
*   each time the CapSense_1_LiftOffDebounce() API is called.
*
* \param offDebounce   The off debounce counter value.
* \param ptrOldTouches The pointer to the old touches structure.
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_LiftOffDebounce(uint8 offDebounce,
                                                       CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches)
{
    uint32 i;
    uint8 liftOffMask = (uint8)(~newActiveIDs) & oldActiveIDs;

    if(liftOffMask != 0u)
    {
        for (i = 0u; i < ptrOldTouches->touchNum; i++)
        {
            /*
             * The old touch is not found in the new touches.
             * Lift off procedure starts and the old touch is copied to the new touches if there is a room.
             */

            if (((uint8)(0x01u << ptrOldTouches->touch[i].id) & liftOffMask) != 0u)
            {
                /* If there is a room in new touches structure and the old touch is not under touch down debounce procedure */
                if ((ptrNewTouches->touchNum < CapSense_1_CSX_MAX_LOCAL_PEAKS) &&
                    (0u == (ptrOldTouches->touch[i].debounce & CapSense_1_CSX_TOUCHPAD_TOUCH_DOWN)))
                {
                    /* Lift off debouncing starts if there is not lift off mask in the old touch */
                    if ((ptrOldTouches->touch[i].debounce & CapSense_1_CSX_TOUCHPAD_LIFT_OFF) == 0u)
                    {
                        ptrOldTouches->touch[i].debounce = offDebounce | CapSense_1_CSX_TOUCHPAD_LIFT_OFF;

                        /* Copy the old finger data to the new one using TransferTouch API to manage age and debounce */
                        CapSense_1_TransferTouch((uint32)ptrNewTouches->touchNum, i, ptrOldTouches);
                        ptrNewTouches->touch[ptrNewTouches->touchNum].x = ptrOldTouches->touch[i].x;
                        ptrNewTouches->touch[ptrNewTouches->touchNum].y = ptrOldTouches->touch[i].y;
                        ptrNewTouches->touch[ptrNewTouches->touchNum].z = ptrOldTouches->touch[i].z;
                        ptrNewTouches->touch[ptrNewTouches->touchNum].rawCount = ptrOldTouches->touch[i].rawCount;
                        ptrNewTouches->touchNum++;
                    }
                    else
                    {
                        /* Check whether debounce counter is reached zero if there is a lift off mask in the old touch */
                       if ((ptrOldTouches->touch[i].debounce & CapSense_1_CSX_TOUCHPAD_DEBOUNCE_MASK) == 0u)
                       {
                            /* Clear lift off mask if debounce counter has reached zero */
                            ptrOldTouches->touch[i].debounce &= (uint8)~CapSense_1_CSX_TOUCHPAD_LIFT_OFF;
                       }
                       else
                       {
                            /* Copy the old finger data to the new one using TransferTouch API to manage age and debounce */
                            CapSense_1_TransferTouch((uint32)ptrNewTouches->touchNum, i, ptrOldTouches);
                            ptrNewTouches->touch[ptrNewTouches->touchNum].x = ptrOldTouches->touch[i].x;
                            ptrNewTouches->touch[ptrNewTouches->touchNum].y = ptrOldTouches->touch[i].y;
                            ptrNewTouches->touch[ptrNewTouches->touchNum].z = ptrOldTouches->touch[i].z;
                            ptrNewTouches->touch[ptrNewTouches->touchNum].rawCount = ptrOldTouches->touch[i].rawCount;
                            ptrNewTouches->touchNum++;
                       }
                    }
                }
            }
        }
    }
}
#endif /* (0u != CapSense_1_OFF_DEBOUNCE_EN) */

