swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
/*******************************************************************************
* Function Name: CapSense_1_CalcDistance
****************************************************************************//**
*
* \brief
*   Calculates squared distance between old and new touches pointed by the input
*   parameters.
*
* \details
*   Calculates squared distance between old and new touches pointed by the input
*   parameters.
*
* \param newIndex      The index of touch in the new touches structure.
* \param oldIndex      The index of touch in the old touches structure.
* \param ptrOldTouches The pointer to the old touches structure.
*
* \return Returns the squared distance.
*
*******************************************************************************/
static uint32 CapSense_1_CalcDistance(uint32 newIndex, uint32 oldIndex,
                                                      CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches)
{
    int32 result;
    int32 xDistance = (int32)(ptrOldTouches->touch[oldIndex].x) - (int32)(ptrNewTouches->touch[newIndex].x);
    int32 yDistance = (int32)(ptrOldTouches->touch[oldIndex].y) - (int32)(ptrNewTouches->touch[newIndex].y);

    result = ((xDistance * xDistance) + (yDistance *yDistance));
    return (uint32)result;
}


/*******************************************************************************
* Function Name: CapSense_1_FillDistanceMap
****************************************************************************//**
*
* \brief
*   Populates the distance map used for the Hungarian method with distance
*   squared values.
*
* \details
*   Distance squared is used instead of distance to eliminate square root
*   calculation, which requires a lot of execution time.
*
* \param distanceMap   The pointer to a 2-dimensional array of int32's
*                          with dimensions CapSense_1_CSX_MAX_LOCAL_PEAKS x
*                          CapSense_1_CSX_MAX_LOCAL_PEAKS
* \param ptrOldTouches The pointer to the old touches structure.
*
* \return The contents of distanceMap[][] are modified.
*
*******************************************************************************/
static void CapSense_1_FillDistanceMap(CapSense_1_CSX_TOUCHPAD_DISTANCE_MAP *distanceMap,
                                             CapSense_1_CSX_TOUCHPAD_DATA_STRUCT *ptrOldTouches)
{
    uint32 i;
    uint32 j;

    if (ptrNewTouches->touchNum >= ptrOldTouches->touchNum)
    {
        for (i = ptrNewTouches->touchNum; i-- > 0u; )
        {
            for (j = ptrOldTouches->touchNum; j-- > 0u; )
            {
                distanceMap[i][j] = (int32)CapSense_1_CalcDistance(i, j, ptrOldTouches);
            }
        }
    }
    else
    {
        for (i = ptrOldTouches->touchNum; i-- > 0u;)
        {
            for (j = ptrNewTouches->touchNum; j-- > 0u;)
            {
                distanceMap[i][j] = (int32)CapSense_1_CalcDistance(j, i, ptrOldTouches);
            }
        }
    }
}


/*******************************************************************************
* Function Name: CapSense_1_Hungarian
****************************************************************************//**
*
* \brief
*   Executes the Hungarian Method on a distance map to track motion of two touch sets
*   (old touches vs new touches)
*
* \details
*   This function uses the Hungarian method described in specification 001-63362.
*   There is no bounds checking on the parameters. It is the calling function's
*   responsibility to ensure parameter validity.
*
* \param rowCount       Number of elements in row of distanceMap matrix. This value must be
*                       greater than or equal to colCount.
* \param colCount       Number of elements in column of distanceMap matrix.This value must
*                       be greater than or equal to 1.
* \param fingerPosIndex The pointer to an array where associations between the
*                             previous and current touches are returned.
* \param distanceMap    The 2-dimensional map of distances between the nodes in each
*                          coordinate set. The 1st index of distanceMap corresponds to nodes
*                          in the 1st coordinate data set, and the 2nd index of distanceMap
*                          corresponds to the 2nd coordinate data set. Each element in
*                          distanceMap is the square of the distance between the
*                          corresponding coordinates in the 1st and 2nd data set.
*
*
* \return Returns fingerPosIndex, the associations between the 1st and 2nd coordinate set are
*                          returned in the array referenced by this pointer. It is indexed
*                          by the 2nd coordinate set, and its elements are the corresponding
*                          index in the 1st coordinate set.
*
*******************************************************************************/
static void CapSense_1_Hungarian(uint8 rowCount, uint8 colCount, int8 *fingerPosIndex,
                             CapSense_1_CSX_TOUCHPAD_DISTANCE_MAP *distanceMap)
{
    int32 col[CapSense_1_CSX_MAX_LOCAL_PEAKS];
    int32 row[CapSense_1_CSX_MAX_LOCAL_PEAKS];
    int32 *mins;
    int32 delta;

    int8 *links;
    int8 *visited;
    int8 *markIndices;

    int32 colValue = 0;
    int32 markedI = 0;
    int32 markedJ = 0;
    int32 i = 0;
    int32 i1 = 0;
    int32 j = 0;
    int32 j1 = 0;

    mins = (int32 *)(distanceMap + CapSense_1_CSX_MAX_LOCAL_PEAKS);
    links = (int8 *)(mins + CapSense_1_CSX_MAX_LOCAL_PEAKS);
    visited = links + CapSense_1_CSX_MAX_LOCAL_PEAKS;
    markIndices = visited + CapSense_1_CSX_MAX_LOCAL_PEAKS;

    (void)memset(col, 0, (uint32)colCount * 4u);

    /* Initialize row and markIndices arrays */
    for (i1 = (int32)rowCount; i1-- > 0;)
    {
        row[i1] = 0;
        markIndices[i1] = -1;
    }

    /* Go through all columns */
    for (i = (int32)colCount; i-- > 0;)
    {
        /* Initialize visited, links, mins arrays. They used for every column */
        for (i1 = (int32)rowCount; i1-- > 0;)
        {
            visited[i1] = 0;
            links[i1] = -1;
            mins[i1] = (int32)CapSense_1_CSX_TOUCHPAD_INT32;
        }

