swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
        /* Next two variables are used to mark column and row */
        markedI = i;
        markedJ = -1;

        while (markedI != -1)
        {
            j = -1;
            colValue = col[markedI];

            /* Go through all rows */
            for (j1 = (int32)rowCount; j1-- > 0;)
            {
                if (visited[j1] == 0)
                {
                    delta = distanceMap[j1][markedI] - row[j1] - colValue;

                    /* Find the minimum element index in column i */
                    if (mins[j1] > delta)
                    {
                        mins[j1] = delta;
                        links[j1] = (int8)markedJ;
                    }

                    if ((j == -1) || (mins[j1] < mins[j]))
                    {
                        j = j1;
                    }
                }
            }

            delta = mins[j];

            /* Go through all row */
            for (j1 = (int32)rowCount; j1-- > 0;)
            {
                if (visited[j1] != 0)
                {
                    col[markIndices[j1]] += delta;
                    row[j1] -= delta;
                }
                else
                {
                    mins[j1] -= delta;
                }
            }

            col[i] +=  delta;

            visited[j] = 1;
            markedJ = j;
            markedI = markIndices[j];
        }

        while (links[j] != -1)
        {
            markIndices[j] = markIndices[links[j]];
            j = links[j];
        }

        markIndices[j] = (int8)i;
    }

    /* Provide an association between two sets of touches */
    for (j = (int32)rowCount; j-- > 0;)
    {
        if (markIndices[j] != -1)
        {
            fingerPosIndex[markIndices[j]] = (int8)j;
        }
    }
}


/*******************************************************************************
* Function Name: CapSense_1_SortByAge
****************************************************************************//**
*
* \brief
*   Sorts the new touches array by age (in decrementing order) and Id (in incrementing order) fields.
*
* \details
*   Sorts the new touches array by age (in decrementing order) and Id (in incrementing order) fields.
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_SortByAge(void)
{
    uint32 i;
    uint32 j;
    CapSense_1_CSX_TOUCHPAD_PEAK_STRUCT tempTouch;
    uint32 newTouchNum = ptrNewTouches->touchNum;

    /*
     * Delete failed touch by coping(rewriting) the last touch content to the failed touch.
     * If the last touch record is invalid try the penult touch record and so on.
     */

    for (i = 0u; i < newTouchNum; i++)
    {
        if (ptrNewTouches->touch[i].id > CapSense_1_CSX_TOUCHPAD_TOUCH_MAX_ID)
        {
            for (j = (newTouchNum - 1u); j > i; j--)
            {
                /* Check the touch records from the last to the current.
                 * If the touch record is valid then replace the current touch record
                 */
                if (ptrNewTouches->touch[j].id <= CapSense_1_CSX_TOUCHPAD_TOUCH_MAX_ID)
                {
                    CapSense_1_CopyTouchRecord(&ptrNewTouches->touch[i], &ptrNewTouches->touch[j]);

                    /* Finish the loop. The valid touch record is found and copied down */
                    break;
                }
                else
                {
                    /* Decrement the number of touch records.
                     * The last touch record is invalid - try the penult touch record
                     */
                    newTouchNum--;
                }
            }

            /* Decrement the number of touch records.
             * The last touch record is valid and copied to the current position (i)
             */
            newTouchNum--;
        }
    }

    /* Set new number of touches */
    ptrNewTouches->touchNum = (uint8)newTouchNum;

    /* Sort new touches structure */
    for (i = 0u; i < newTouchNum; i++)
    {
        for (j = (i + 1u); j < newTouchNum; j++)
        {
            /* if next touches have higher age or lower id with the same age then swap touches */
            if ((ptrNewTouches->touch[i].age < ptrNewTouches->touch[j].age)      ||
                ((ptrNewTouches->touch[i].age == ptrNewTouches->touch[j].age) &&
                 (ptrNewTouches->touch[i].id > ptrNewTouches->touch[j].id)))
            {
                /* Swap touches */
                CapSense_1_CopyTouchRecord(&tempTouch, &ptrNewTouches->touch[i]);
                CapSense_1_CopyTouchRecord(&ptrNewTouches->touch[i], &ptrNewTouches->touch[j]);
                CapSense_1_CopyTouchRecord(&ptrNewTouches->touch[j], &tempTouch);
            }
        }
    }
}


/*******************************************************************************
* Function Name: CapSense_1_CopyTouchRecord
****************************************************************************//**
*
* \brief
*   Copies content from the source touch structure to the destination touch structure.
*
* \details
*   Copies content from the source touch structure to the destination touch structure.
*
* \param *destination The pointer to the destination touch structure.
* \param *source      The pointer to the source touch structure.
*
*******************************************************************************/
static void CapSense_1_CopyTouchRecord(CapSense_1_CSX_TOUCHPAD_PEAK_STRUCT *destination,
                                                       CapSense_1_CSX_TOUCHPAD_PEAK_STRUCT *source)
{
    destination->x        =  source->x;
    destination->y        =  source->y;
    destination->z        =  source->z;
    destination->rawCount =  source->rawCount;
    destination->id       =  source->id;
    destination->age      =  source->age;
    destination->debounce =  source->debounce;
}


/*******************************************************************************
* Function Name: CapSense_1_DpFilterTouchRecord
****************************************************************************//**
*
* \brief
*   Filter position data of every valid touch, if there is a room in RAM Widget Data Structure
*   and update corresponding fields in RAM Widget Data Structure
*
* \details
*  This API checks every touch in the new touches structure if it is valid until there is a room
*  in the RAM Widget Data Structure (where touch reports are stored). If touch is valid
*  (valid id and age > 0) then touch is filtered if filter is enabled. At the end the
*  corresponding fields are updated in the RAM Widget Data Structure.
*
* \param ptrFlashWdgt The pointer to the Flash Widget Structure.
*
* \return The number of reported touches to the RAM Data Structure.
*
*******************************************************************************/
uint32 CapSense_1_DpFilterTouchRecord(CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 i;
    uint32 reportedTouchNum = 0u;
    CapSense_1_RAM_WD_CSX_TOUCHPAD_STRUCT *ptrWidgetRam = ptrFlashWdgt->ptr2WdgtRam;

