swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
    #if (0u != CapSense_1_POSITION_FILTER_EN)
        uint32 oldIdMask = 0u;
        uint32 j;
        uint16 filteredX;
        uint16 filteredY;
        CapSense_1_TOUCHPAD_POS_HISTORY_STRUCT *ptrHistory;

    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        ptrHistory = ptrFlashWdgt->ptr2PosHistory;
        /* Find what Ids were active in the previous report */
        for (i = 0u; i < CapSense_1_CSX_MAX_FINGERS; i++)
        {
            oldIdMask |= 0x01Lu << ptrWidgetRam->touch[i].id;
        }
    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

    /* Go through all touch fields in RAM Data Structure */
    for (i = 0u; i < CapSense_1_CSX_MAX_FINGERS; i++)
    {
        /* Check if touch is valid to be reported: age has to be higher than 0. Id has been checked in SortByAge API */
        if ((i < ptrNewTouches->touchNum) && (ptrNewTouches->touch[i].age > 0u))
        {
            #if (0u == CapSense_1_POSITION_FILTER_EN)
                /* Report touch to the RAM Data Structure if position filter is disabled in general */
                ptrWidgetRam->touch[i].x = ptrNewTouches->touch[i].x;
                ptrWidgetRam->touch[i].y = ptrNewTouches->touch[i].y;
                ptrWidgetRam->touch[i].z = ptrNewTouches->touch[i].z;
                ptrWidgetRam->touch[i].id = ptrNewTouches->touch[i].id;
            #else

                filteredX = ptrNewTouches->touch[i].x;
                filteredY = ptrNewTouches->touch[i].y;

                /* Initialize position and filter history if the touch has the id that was absent in the previous touch report */
                if (0u == (oldIdMask & (1Lu << ptrNewTouches->touch[i].id)))
                {
                    ptrWidgetRam->touch[i].x = ptrNewTouches->touch[i].x;
                    ptrWidgetRam->touch[i].y = ptrNewTouches->touch[i].y;
                    ptrWidgetRam->touch[i].z = ptrNewTouches->touch[i].z;
                    ptrWidgetRam->touch[i].id = ptrNewTouches->touch[i].id;
                    if (NULL != ptrHistory)
                    {
                        CapSense_1_InitPosFiltersDd(&ptrHistory[i], filteredX, filteredY);
                    }
                }
                /* Find corresponding position history of the new touch (by id) in the RAW Widget Data Structure and Position History */
                else
                {
                    /*
                    * Index <i> addresses new touch array and final reported in data structure array.
                    * Index <j> addresses filter history and previously reported in data structure array.
                    *
                    * If new touch appears, then it is always added at the and of arrays, therefore it
                    * is safe to overwrite history with new touch.
                    * Another case is moving touch from its previous reported index to new index.
                    * This new index is always lower, so filter history of touch (i-1) was already taken
                    * and processed for touch (i-1). Therefore, again, it is safely to copy filter history
                    * from j to i.
                    */
                    for(j = 0u; j < CapSense_1_CSX_MAX_FINGERS; j++)
                    {
                        if(ptrNewTouches->touch[i].id == ptrWidgetRam->touch[j].id)
                        {
                            CapSense_1_RunPosFiltersDd(ptrFlashWdgt, i, j, &filteredX, &filteredY);

                            ptrWidgetRam->touch[i].x = filteredX;
                            ptrWidgetRam->touch[i].y = filteredY;
                            ptrWidgetRam->touch[i].z = ptrNewTouches->touch[i].z;
                            ptrWidgetRam->touch[i].id = ptrNewTouches->touch[i].id;
                        }
                    }
                }
            #endif
            reportedTouchNum++;
        }
        else
        {
            ptrWidgetRam->touch[i].x = CapSense_1_CSX_TOUCHPAD_POSITION_NONE;
            ptrWidgetRam->touch[i].y = CapSense_1_CSX_TOUCHPAD_POSITION_NONE;
            ptrWidgetRam->touch[i].z = CY_LO8(CapSense_1_CSX_TOUCHPAD_POSITION_NONE);
            ptrWidgetRam->touch[i].id = CapSense_1_CSX_TOUCHPAD_UNDEFINED;

            #if (0u != CapSense_1_POSITION_FILTER_EN)
                if (NULL != ptrHistory)
                {
                    /* Initialize history for non-valid touches */
                    CapSense_1_InitPosFiltersDd(&ptrHistory[i], CapSense_1_CSX_TOUCHPAD_POSITION_NONE, CapSense_1_CSX_TOUCHPAD_POSITION_NONE);
                }
            #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
        }
    }
    return reportedTouchNum;
}

#endif /* #if CapSense_1_CSX_TOUCHPAD_WIDGET_EN */


#if (0u != CapSense_1_POSITION_FILTER_EN)
/*******************************************************************************
* Function Name: CapSense_1_InitPosFiltersSd
****************************************************************************//**
*
* \brief
*  Writes desired value into single-dimension position filter history.
*
* \details
*  Writes desired value into single-dimension position filter history.
*
* \param ptrHistory
*  The pointer to the structure that holds previous historical position value.
*
* \param value
*  The desired value to initialize position filters history.
*
*******************************************************************************/
void CapSense_1_InitPosFiltersSd(CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrHistory, uint16 value)
{
    if (NULL != ptrHistory)
    {
        #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN)
            ptrHistory->posMedianZ1 = value;
            ptrHistory->posMedianZ2 = value;
        #endif /* #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN) */

        #if (0u != CapSense_1_POS_IIR_FILTER_EN)
            ptrHistory->posIIR = value;
        #endif /* #if (0u != CapSense_1_POS_IIR_FILTER_EN) */

        #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
            ptrHistory->posAIIR = value;
        #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

        #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN)
            ptrHistory->posAverage = value;
        #endif /* #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN) */

        #if (0u != CapSense_1_POS_JITTER_FILTER_EN)
            ptrHistory->posJitter = value;
        #endif /* #if (0u != CapSense_1_POS_JITTER_FILTER_EN) */
    }
}

#if ((0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) || (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN))
/*******************************************************************************
* Function Name: CapSense_1_InitPosFiltersDd
****************************************************************************//**
*
* \brief
*  Writes desired value into two-dimension position filter history.
*
* \details
*  Writes desired value into two-dimension position filter history.
*
* \param ptrHistory
*  The pointer to the structure that holds previous historical position value.
*
* \param posX
*  The desired value of X position to initialize position filters history.
*
* \param posY
*  The desired value of Y position to initialize position filters history.
*
*******************************************************************************/
void CapSense_1_InitPosFiltersDd(CapSense_1_TOUCHPAD_POS_HISTORY_STRUCT *ptrHistory, uint16 posX, uint16 posY)
{
    if (NULL != ptrHistory)
    {
        CapSense_1_InitPosFiltersSd(&ptrHistory->xPos, posX);
        CapSense_1_InitPosFiltersSd(&ptrHistory->yPos, posY);
    }
}


