swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Centroid_LL.c
/*******************************************************************************
* Function Name: CapSense_1_RunPosFiltersDd
****************************************************************************//**
*
* \brief
*  Filters two-dimension touch position of touchpad widget.
*
* \details
*  Filters two-dimension touch position of touchpad widget.
*
* \param ptrFlashWdgt
*  The pointer to the Flash Widget Object.
*
* \param i
*  The index in the touch array where newly filtered position should be stored to.
*
* \param j
*  The index in the touch array where previous position filter history should be
*  taken from.
*
* \param posX
*  The pointer to new X position to be filtered.
*
* \param posY
*  The pointer to new Y position to be filtered.
*
*******************************************************************************/
void CapSense_1_RunPosFiltersDd(CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt, uint32 i, uint32 j,
            uint16 * posX, uint16 * posY)
{
    uint16 filteredX;
    uint16 filteredY;
    uint32 filterConfig;
    CapSense_1_TOUCHPAD_POS_HISTORY_STRUCT *ptrHistory;
    CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrHistoryPosX;
    CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrHistoryPosY;
    CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrNewHistoryPosX;
    CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrNewHistoryPosY;

    #if ((0u != CapSense_1_POS_AVERAGE_FILTER_EN) || \
         (0u != CapSense_1_POS_MEDIAN_FILTER_EN))
        uint16 tempPosition;
    #endif /* ((0u != CapSense_1_POS_AVERAGE_FILTER_EN) ||
         (0u != CapSense_1_POS_MEDIAN_FILTER_EN)) */

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        ADAPTIVE_FILTER_CONTEXT_STRUCT contextAIIR;
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        ADAPTIVE_FILTER_CONFIG_STRUCT const *ptrAiirConfig = NULL;
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    filteredX = *posX;
    filteredY = *posY;
    filterConfig = ptrFlashWdgt->staticConfig;
    ptrHistory = ptrFlashWdgt->ptr2PosHistory;
    ptrHistoryPosX = &ptrHistory[j].xPos;
    ptrHistoryPosY = &ptrHistory[j].yPos;
    ptrNewHistoryPosX = &ptrHistory[i].xPos;
    ptrNewHistoryPosY = &ptrHistory[i].yPos;

    #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN)
        if (0u != (filterConfig & CapSense_1_POS_MEDIAN_FILTER_MASK))
        {
            tempPosition = (uint16)CapSense_1_FtMedian((uint32)ptrHistoryPosX->posMedianZ2, (uint32)ptrHistoryPosX->posMedianZ1, (uint32)filteredX);
            /* Store filter history from <j> place of previous report to <i> place of new report */
            ptrNewHistoryPosX->posMedianZ2 = ptrHistoryPosX->posMedianZ1;
            ptrNewHistoryPosX->posMedianZ1 = filteredX;
            filteredX = tempPosition;
            tempPosition = (uint16)CapSense_1_FtMedian((uint32)ptrHistoryPosY->posMedianZ2, (uint32)ptrHistoryPosY->posMedianZ1, (uint32)filteredY);
            /* Store filter history from <j> place of previous report to <i> place of new report */
            ptrNewHistoryPosY->posMedianZ2 = ptrHistoryPosY->posMedianZ1;
            ptrNewHistoryPosY->posMedianZ1 = filteredY;
            filteredY = tempPosition;
        }
    #endif

    #if (0u != CapSense_1_POS_IIR_FILTER_EN)
        if (0u != (filterConfig & CapSense_1_POS_IIR_FILTER_MASK))
        {
            filteredX = (uint16)CapSense_1_FtIIR1stOrder((uint32)filteredX, (uint32)ptrHistoryPosX->posIIR, (uint32)ptrFlashWdgt->iirFilterCoeff, 0uL);
            ptrNewHistoryPosX->posIIR = filteredX;
            filteredY = (uint16)CapSense_1_FtIIR1stOrder((uint32)filteredY, (uint32)ptrHistoryPosY->posIIR, (uint32)ptrFlashWdgt->iirFilterCoeff, 0uL);
            ptrNewHistoryPosY->posIIR = filteredY;
        }
    #endif /* #if (0u != CapSense_1_POS_IIR_FILTER_EN) */

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        if (0u != (filterConfig & CapSense_1_AIIR_FILTER_MASK))
        {
            switch(CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
            {
            #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
                case CapSense_1_SENSE_METHOD_CSD_E:
                    ptrAiirConfig = &(((CapSense_1_RAM_WD_CSD_TOUCHPAD_STRUCT *)ptrFlashWdgt->ptr2WdgtRam)->aiirConfig);
                    break;
            #endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */

            #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
                case CapSense_1_SENSE_METHOD_CSX_E:
                    ptrAiirConfig = &(((CapSense_1_RAM_WD_CSX_TOUCHPAD_STRUCT *)ptrFlashWdgt->ptr2WdgtRam)->aiirConfig);
                    break;
            #endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

            default:
                CY_ASSERT(0 != 0);
                break;
            }
            contextAIIR.previousX = ptrHistoryPosX->posAIIR;
            contextAIIR.previousY = ptrHistoryPosY->posAIIR;
            contextAIIR.coefficient = ptrHistoryPosX->posAIIRCoeff;
            AdaptiveFilter_Run(ptrAiirConfig, &contextAIIR, &filteredX, &filteredY);
            ptrNewHistoryPosX->posAIIR = contextAIIR.previousX;
            ptrNewHistoryPosY->posAIIR = contextAIIR.previousY;
            ptrNewHistoryPosX->posAIIRCoeff = contextAIIR.coefficient;
        }
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN)
        if (0u != (filterConfig & CapSense_1_POS_AVERAGE_FILTER_MASK))
        {
            tempPosition = filteredX;
            filteredX = (uint16)(filteredX + ptrHistoryPosX->posAverage) >> 1u;
            ptrNewHistoryPosX->posAverage = tempPosition;
            tempPosition = filteredY;
            filteredY = (uint16)(filteredY + ptrHistoryPosY->posAverage) >> 1u;
            ptrNewHistoryPosY->posAverage = tempPosition;
        }
    #endif /* #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN) */

    #if (0u != CapSense_1_POS_JITTER_FILTER_EN)
        if (0u != (filterConfig & CapSense_1_POS_JITTER_FILTER_MASK))
        {
            filteredX = (uint16)CapSense_1_FtJitter((uint32)filteredX, (uint32)ptrHistoryPosX->posJitter);
            ptrNewHistoryPosX->posJitter = filteredX;
            filteredY = (uint16)CapSense_1_FtJitter((uint32)filteredY, (uint32)ptrHistoryPosY->posJitter);
            ptrNewHistoryPosY->posJitter = filteredY;
        }
    #endif /* #if (0u != CapSense_1_POS_JITTER_FILTER_EN) */

    *posX = filteredX;
    *posY = filteredY;
}
#endif /* ((0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) || (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)) */

#endif /* (0u != CapSense_1_POSITION_FILTER_EN) */


/* [] END OF FILE */
